/********************************************************************************
* Copyright 2026 Miyabi															*
*																				*
* Project Name	: Numerical Stacking Puzzle (Windows 11, Visual Studio 2022)	*
* File Name		: midkey.cpp													*
* Author		: Miyabi														*
* Create		: 2026/06/01 													*
* Purpose		: Key入力のミドルウェア											*
********************************************************************************/

/********************************************************************************
*	Include Files																*
********************************************************************************/
#include "framework.h"	/* 必須 */
#include "define.h"
#include "midkey.h"

/********************************************************************************
*	Defines																		*
********************************************************************************/
// シーケンス番号
#define	E_SEQ_INIT	0	// 初期状態
#define	E_SEQ_IDLE	1	// 待機状態

/********************************************************************************
*	Define Static Instance														*
********************************************************************************/
CRMidKey*	CRMidKey::m_lpThis;

/********************************************************************************
*	CRMidKey Public Constructor(s)/Destructor									*
********************************************************************************/

/********************************************************************************
* FunctionName:	CRMidKey														*
* Function    :	コンストラクタ													*
* Argument(s) :	none															*
* Attention(s): このコンストラクタは使用しない(引数付きで生成する事)			*
********************************************************************************/
CRMidKey::CRMidKey(void)
{
	// 引数付きで作成する事
	Assert(FALSE);
}

/********************************************************************************
* FunctionName:	CRMidKey														*
* Function    :	コンストラクタ													*
* Argument(s) :	hWnd=ウィンドウハンドル											*
********************************************************************************/
CRMidKey::CRMidKey(HWND hWnd)
{
	//-----------------------------------------------------------------------
	// インスタンスポインタ保存
	m_lpThis = this;

	//-----------------------------------------------------------------------
	// シーケンス設定（関数ポインタ配列作成）
	m_lpSeq[E_SEQ_INIT]   = &CRMidKey::SeqInit;	// 初期状態
	m_lpSeq[E_SEQ_IDLE]   = &CRMidKey::SeqIdle;	// 待機状態

	//-----------------------------------------------------------------------
	// バッファクリア
	// キー入力判定初期化
	memset(&m_kiKeyIn, 0, sizeof(m_kiKeyIn));
	memset(&m_kiKeyOn, 0, sizeof(m_kiKeyOn));
	memset(&m_kiKeyDown, 0, sizeof(m_kiKeyDown));
	// デバイス入力状態初期化
	m_nMouseX = 0;
	m_nMouseY = 0;

	//-----------------------------------------------------------------------
	// 初期値設定
	m_hAppWnd = hWnd;		// ウィンドウハンドル
	m_nSeq = E_SEQ_INIT;	// 初期シーケンス=初期状態

	// 初期化正常終了
	this->CRoutine::InitOK();

	Debuglog((LPWSTR)(L"CRMidKey"));
}

/********************************************************************************
* FunctionName:	~CRMidKey														*
* Function    :	デストラクタ													*
* Argument(s) :	none															*
********************************************************************************/
CRMidKey::~CRMidKey(void)
{
	// インスタンスポインタ破棄
	m_lpThis = nullptr;

	Debuglog((LPWSTR)(L"~CRMidKey"));
}

/********************************************************************************
*	Private Methods																*
********************************************************************************/

/********************************************************************************
* FunctionName:	UpdateMousePos													*
* Function    :	マウス位置情報の更新処理										*
* Argument(s) :	none															*
* Return      :	none															*
********************************************************************************/
void
CRMidKey::UpdateMousePos(void)
{
	// マウスの位置を取得する
	POINT ptCsr;
	if(::GetCursorPos(&ptCsr))
	{
		// クライアント領域の座標系に変換する
		if(::ScreenToClient(m_hAppWnd, &ptCsr))
		{
			// マウス位置取得＆変換成功 -> 更新
			WINDOWPLACEMENT wp;
			POINT ptWnd;
			wp.length = sizeof(WINDOWPLACEMENT);
			GetWindowPlacement(m_hAppWnd, &wp);
			ptWnd.x = RectWidth(wp.rcNormalPosition);
			ptWnd.y = RectHeight(wp.rcNormalPosition);
			if(wp.showCmd == SW_SHOWMAXIMIZED)
			{
			}
			else
			{
				// 理由は不明だが、X方向クライアントエリアが 5dot大きく、カーソルが12dot小さい値になっている
				ptWnd.x -=  5 + 12;
				// 理由は不明だが、Y方向クライアントエリアが45dot大きく、カーソルが15dot小さい値になっている
				ptWnd.y -= 45 + 15;
			}
		
			// マウス位置の更新
			m_nMouseX = (E_WID_X * ptCsr.x / ptWnd.x);
			m_nMouseY = (E_WID_Y * ptCsr.y / ptWnd.y);
		}
	}
}

/********************************************************************************
* FunctionName:	UpdateKey														*
* Function    :	キー入力状態の更新処理											*
* Argument(s) :	none															*
* Return      :	none															*
********************************************************************************/
void
CRMidKey::UpdateKey(void)
{
	//-----------------------------------------------------------------------
	// 前回のキー入力値の保存
	KEYINFO kiKeyBak;
	
	kiKeyBak = m_kiKeyOn;	// キー入力情報
	m_kiKeyOn = m_kiKeyIn;

	// キー入力立ち上がり検出
	for(long n = 0; n < sizeof(KEYINFO); n++)
	{
		m_kiKeyDown.abBit[n] = (m_kiKeyOn.abBit[n] & !kiKeyBak.abBit[n]);
	}
}

/********************************************************************************
*	Private Methods (Sequence)													*
********************************************************************************/

/********************************************************************************
* FunctionName:	SeqInit															*
* Function    :	シーケンス処理:初期状態											*
* Argument(s) :	none															*
* Return      :	FALSE=処理終了（オブジェクト破棄）								*
********************************************************************************/
bool
CRMidKey::SeqInit(void)
{
	Debuglog((LPWSTR)(L"MidKeyInit."));

	// シーケンス -> 待機状態
	m_nSeq = E_SEQ_IDLE;

	return TRUE;
}

/********************************************************************************
* FunctionName:	SeqIdle															*
* Function    :	シーケンス処理:待機状態											*
* Argument(s) :	none															*
* Return      :	FALSE=処理終了（オブジェクト破棄）								*
********************************************************************************/
bool
CRMidKey::SeqIdle()
{
	//-----------------------------------------------------------------------
	// キー入力
	UpdateMousePos();

	//-----------------------------------------------------------------------
	// キー状態更新
	UpdateKey();

	return TRUE;
}

/********************************************************************************
*	Public Methods																*
********************************************************************************/

/********************************************************************************
* FunctionName:	Update															*
* Function    :	定期更新処理													*
* Argument(s) :	none															*
* Return      :	FALSE=処理終了（オブジェクト破棄）								*
* Attention(s):	呼び出し周期＝1/60sec											*
********************************************************************************/
bool
CRMidKey::Update(void)
{
	//-----------------------------------------------------------------------
	// 基底クラスの処理
	if(this->CRoutine::Update() == FALSE)
	{
		return FALSE;
	}

	//-----------------------------------------------------------------------
	// シーケンス処理
	if((this->*m_lpSeq[m_nSeq])() == FALSE)
	{
		return FALSE;
	}

	return TRUE;
}
