/********************************************************************************
* Copyright 2026 Miyabi															*
*																				*
* Project Name	: Numerical Stacking Puzzle (Windows 11, Visual Studio 2022)	*
* File Name		: nextdat.cpp													*
* Author		: Miyabi														*
* Create		: 2026/06/01 													*
* Purpose		: 次に落下する箱のデータ管理									*
********************************************************************************/

/********************************************************************************
*	Include Files																*
********************************************************************************/
#include "framework.h"	/* 必須 */
#include "define.h"
#include "nextdat.h"

/********************************************************************************
*	Defines																		*
********************************************************************************/
// シーケンス
#define	E_SEQ_INIT	(0)	// 初期状態
#define	E_SEQ_IDLE	(1)	// 待機状態

#define	E_NEXT_BOX_VAL_NUM	(6)

/********************************************************************************
*	Define Static Instance														*
********************************************************************************/
CRNextDat*	CRNextDat::m_lpThis;

/********************************************************************************
*	CRNextDat Public Constructor(s)/Destructor									*
********************************************************************************/

/********************************************************************************
* FunctionName:	CRNextDat														*
* Function    :	コンストラクタ													*
* Argument(s) :	none															*
********************************************************************************/
CRNextDat::CRNextDat(void)
{
	long n;
	//-----------------------------------------------------------------------
	// インスタンスポインタ保存
	m_lpThis = this;

	//-----------------------------------------------------------------------
	// 初期化処理
	// シーケンス設定（関数ポインタ配列作成）
	m_lpSeq[E_SEQ_INIT] = &CRNextDat::SeqInit;	// 初期状態
	m_lpSeq[E_SEQ_IDLE] = &CRNextDat::SeqIdle;	// 待機状態

	//-----------------------------------------------------------------------
	// バッファクリア
	memset(&(m_anNextBoxVal[0]), -1, sizeof(m_anNextBoxVal));

	//-----------------------------------------------------------------------
	// 初期値設定
	m_tmBoxVal = 6;			// 箱の値ランダムタイマ
	m_nNextBoxCnt = 0;		// 次回箱の生成数 <- 0
	m_nSeq = E_SEQ_INIT;	// 初期シーケンス=初期状態

	//-----------------------------------------------------------------------
	// この時点で次回箱の中身をセットする
	for(n = 0; n < E_NEXT_BOX_NUM; n++)
	{
		m_anNextBoxVal[n] = m_nNextBoxCnt;
		m_nNextBoxCnt += 1;
	}

	// 初期化正常終了
	this->CRoutine::InitOK();

	Debuglog((LPWSTR)(L"CRNextDat"));
}

/********************************************************************************
* FunctionName:	~CRNextDat														*
* Function    :	デストラクタ													*
* Argument(s) :	none															*
********************************************************************************/
CRNextDat::~CRNextDat(void)
{
	// インスタンスポインタ破棄
	m_lpThis = nullptr;

	Debuglog((LPWSTR)(L"~CRNextDat"));
}

/********************************************************************************
*	Private Methods																*
********************************************************************************/

/********************************************************************************
* FunctionName:	GetNextBoxNum													*
* Function    :	次回箱の値を算出する											*
* Argument(s) :	none															*
* Return      :	次回箱の値														*
********************************************************************************/
long
CRNextDat::GetNextBoxNum(void)
{
	long ret;
	
	// 最初は0～E_NEXT_BOX_VAL_NUM-1の値を順に返す
	// 以降は処理時間 % E_NEXT_BOX_VAL_NUMの疑似乱数で値を返す
	if(m_nNextBoxCnt < E_NEXT_BOX_VAL_NUM)
	{
		ret = m_nNextBoxCnt;
	}
	else
	{
		ret = m_tmBoxVal % E_NEXT_BOX_VAL_NUM;
	}
	m_nNextBoxCnt++;

	return ret;
}

/********************************************************************************
*	Private Methods (Sequence)													*
********************************************************************************/

/********************************************************************************
* FunctionName:	SeqInit															*
* Function    :	シーケンス処理:初期状態											*
* Argument(s) :	none															*
* Return      :	FALSE=処理終了（オブジェクト破棄）								*
********************************************************************************/
bool
CRNextDat::SeqInit(void)
{
	// シーケンス -> 待機状態
	m_nSeq = E_SEQ_IDLE;

	return TRUE;
}

/********************************************************************************
* FunctionName:	SeqIdle															*
* Function    :	シーケンス処理:待機状態											*
* Argument(s) :	none															*
* Return      :	FALSE=処理終了（オブジェクト破棄）								*
********************************************************************************/
bool
CRNextDat::SeqIdle(void)
{
	if(m_tmBoxVal == 0)
	{
		m_tmBoxVal = E_NEXT_BOX_VAL_NUM;
	}

	return TRUE;
}

/********************************************************************************
*	Public Methods																*
********************************************************************************/

/********************************************************************************
* FunctionName:	Update															*
* Function    :	定期更新処理													*
* Argument(s) :	none															*
* Return      :	FALSE=処理終了（オブジェクト破棄）								*
* Attention(s):	呼び出し周期＝1/60sec											*
********************************************************************************/
bool
CRNextDat::Update()
{
	//-----------------------------------------------------------------------
	// 基底クラスの処理
	if(this->CRoutine::Update() == FALSE)
	{
		return FALSE;
	}
	
	//-----------------------------------------------------------------------
	// タイマー
	Dec(m_tmBoxVal);
	
	//-----------------------------------------------------------------------
	// シーケンス処理
	if((this->*m_lpSeq[m_nSeq])() == FALSE)
	{
		return FALSE;
	}

	return TRUE;
}

/********************************************************************************
* FunctionName:	SetVal															*
* Function    :	次回箱の格納値を設定											*
* Argument    :	次回箱の格納位置X												*
*				格納値															*
* Return      :	none															*
********************************************************************************/
void
CRNextDat::SetVal(long nX, long nVal)
{
	m_anNextBoxVal[nX] = nVal;
}

/********************************************************************************
* FunctionName:	GetVal															*
* Function    :	次回箱の格納値を取得											*
* Argument    :	次回箱の格納位置X												*
* Return      :	格納値															*
********************************************************************************/
long
CRNextDat::GetVal(long nX)
{
	return m_anNextBoxVal[nX];
}

/********************************************************************************
* FunctionName:	GetNextBoxCnt													*
* Function    :	次回箱の生成数を取得											*
* Argument    :	none															*
* Return      :	次回箱の生成数													*
********************************************************************************/
long
CRNextDat::GetNextBoxCnt(void)
{
	return m_nNextBoxCnt;
}

/********************************************************************************
* FunctionName:	SetNextBoxCnt													*
* Function    :	次回箱の生成数を設定											*
* Argument    :	次回箱の生成数													*
* Return      :	none															*
********************************************************************************/
void
CRNextDat::SetNextBoxCnt(long nNextBoxCnt)
{
	m_nNextBoxCnt = nNextBoxCnt;
}

/********************************************************************************
* FunctionName:	GetBoxValTm														*
* Function    :	次回箱の値ランダムタイマを取得									*
* Argument    :	none															*
* Return      :	ランダムタイマのカウント値										*
********************************************************************************/
long
CRNextDat::GetBoxValTm(void)
{
	return m_tmBoxVal;
}

/********************************************************************************
* FunctionName:	SetBoxValTm														*
* Function    :	次回箱の値ランダムタイマを設定									*
* Argument    :	ランダムタイマのカウント値										*
* Return      :	none															*
********************************************************************************/
void
CRNextDat::SetBoxValTm(long tmBoxVal)
{
	m_tmBoxVal = tmBoxVal;
}

/********************************************************************************
* FunctionName:	ExecPush														*
* Function    :	次回箱の落下指示												*
* Argument    :	none															*
* Return      :	落下する次回箱の格納値											*
********************************************************************************/
long
CRNextDat::ExecPush(void)
{
	long ret;		// 戻り値
	long nCntX;		// 処理カウンタX

	ret = m_anNextBoxVal[0];

	// セルデータサイズ分繰り返す
	for(nCntX = 0; nCntX < E_NEXT_BOX_NUM-1; nCntX++)
	{
		m_anNextBoxVal[nCntX] = m_anNextBoxVal[nCntX+1];
	}
	
	m_anNextBoxVal[nCntX] = GetNextBoxNum();

	return ret;
}
