/********************************************************************************
* Copyright 2026 Miyabi															*
*																				*
* Project Name	: Numerical Stacking Puzzle (Windows 11, Visual Studio 2022)	*
* File Name		: routine.cpp													*
* Author		: Miyabi														*
* Create		: 2026/06/01 													*
* Purpose		: 全ルーチン管理基底クラス										*
********************************************************************************/

/********************************************************************************
*	Include Files																*
********************************************************************************/
#include "framework.h"	/* 必須 */
#include "define.h"
#include "debug.h"
#include "routine.h"

/********************************************************************************
*	Defines																		*
********************************************************************************/

/********************************************************************************
*	CRoutine Public Constructor(s)/Destructor									*
********************************************************************************/

/********************************************************************************
* FunctionName:	CRoutine														*
* Function    :	コンストラクタ													*
* Argument(s) :	none															*
********************************************************************************/
CRoutine::CRoutine(void)
{
	//-----------------------------------------------------------------------
	// 初期値設定
	m_nChildNum = 0;		// 子ルーチン数 <- 0(なし)
	m_lplpRtChild = NULL;	// 子ルーチンへのポインタ <- NULL(子ルーチンなし)
	m_lpChildRet = NULL;	// 子ルーチンからの戻り値 <- NULL(子ルーチンなし)

	m_nReturn = 0;			// 親ルーチンへの戻り値 <- 0
	m_bInitOK = FALSE;		// 初期化正常終了フラグ <- 未
}

/********************************************************************************
* FunctionName:	~CRoutine														*
* Function    :	デストラクタ													*
* Argument(s) :	none															*
********************************************************************************/
CRoutine::~CRoutine(void)
{
	Cleanup();
}

/********************************************************************************
*	Private Methods																*
********************************************************************************/

/********************************************************************************
* FunctionName:	Cleanup															*
* Function    :	子ルーチンのクリア処理											*
* Argument    :	none															*
* Return      :	none															*
********************************************************************************/
void
CRoutine::Cleanup(void)
{
	if(m_lplpRtChild)
	{
		for(long n = 0; n < m_nChildNum; n++)
		{
			FREE(m_lplpRtChild[n]);
		}
	}
	FREE(m_lplpRtChild);
	FREE(m_lpChildRet);

	m_nChildNum = 0;
}

/********************************************************************************
*	Protected Methods															*
********************************************************************************/

/********************************************************************************
* FunctionName:	SetChildNum														*
* Function    :	子ルーチン数の設定と初期化										*
* Argument    :	子ルーチン数													*
* Return      :	子ルーチン数設定と初期化の成否									*
********************************************************************************/
bool
CRoutine::SetChildNum(long nChildNum)
{
	if(nChildNum < 0)
	{
		return FALSE;
	}

	//-----------------------------------------------------------------------
	// 既に生成されているインスタンスを消去
	Cleanup();

	m_nChildNum = nChildNum;
	if(nChildNum == 0)
	{
		return TRUE;
	}

	//-----------------------------------------------------------------------
	// インスタンス生成
	m_lplpRtChild = new CRoutine*[m_nChildNum];
	m_lpChildRet = new long[m_nChildNum];
	if(!m_lplpRtChild || !m_lpChildRet)
	{
		// 生成に失敗 -> 初期化失敗として終了
		Cleanup();
		return FALSE;
	}

	//-----------------------------------------------------------------------
	// 初期値＝子ルーチン無し
	for(long n = 0; n < m_nChildNum; n++)
	{
		m_lplpRtChild[n] = NULL;
		m_lpChildRet[n] = 0;
	}

	return TRUE;
}

/********************************************************************************
* FunctionName:	InitOK															*
* Function    :	初期化正常終了フラグセット										*
* Argument    :	none															*
* Return      :	none															*
********************************************************************************/
void
CRoutine::InitOK(void)
{
	m_bInitOK = TRUE;
}

/********************************************************************************
*	Public Methods																*
********************************************************************************/

/********************************************************************************
* FunctionName:	Update															*
* Function    :	子ルーチンの更新処理											*
* Argument(s) :	none															*
* Return      :	FALSE=処理終了（オブジェクト破棄）								*
********************************************************************************/
bool
CRoutine::Update(void)
{
	// 例外処理：初期化失敗
	if(m_bInitOK == FALSE)
	{
		Assert(FALSE);
		return FALSE;
	}

	// 子ルーチン無 -> 処理不要
	if(!m_lplpRtChild)
	{
		return TRUE;
	}

	// 子ルーチンが登録されていたらUpdateを呼び出す
	// Updateの戻り値でFALSEを返した子ルーチンは消去する
	for(long n = 0; n < m_nChildNum; n++)
	{
		if(m_lplpRtChild[n])
		{
			// 子ルーチンあり
			if(!m_lplpRtChild[n]->Update())
			{
				// 処理終了 -> 戻り値更新後にインスタンス破棄
				m_lpChildRet[n] = m_lplpRtChild[n]->m_nReturn;
				FREE(m_lplpRtChild[n]);
			}
			else
			{
				// 処理継続 -> 戻り値更新
				m_lpChildRet[n] = m_lplpRtChild[n]->m_nReturn;
			}
		}
	}
	return TRUE;
}
