/********************************************************************************
* Copyright 2026 Miyabi															*
*																				*
* Project Name	: Numerical Stacking Puzzle (Windows 11, Visual Studio 2022)	*
* File Name		: titlelblset.cpp												*
* Author		: Miyabi														*
* Create		: 2026/06/01 													*
* Purpose		: タイトル用ラベルオブジェクト全体管理							*
********************************************************************************/

/********************************************************************************
*	Include Files																*
********************************************************************************/
#include "framework.h"	/* 必須 */
#include "define.h"
#include "titlelblset.h"
#include "titlelbl.h"

/********************************************************************************
*	Defines																		*
********************************************************************************/
// シーケンス
#define	E_SEQ_INIT	(0)	// 初期状態
#define	E_SEQ_IDLE	(1)	// 待機状態

// 子プロセス
#define	E_RT_NUM	(E_TITLE_LBL_TYPE_NUM)//子プロセスの上限数

/********************************************************************************
*	CRTitleLblSet Public Constructor(s)/Destructor								*
********************************************************************************/

/********************************************************************************
* FunctionName:	CRTitleLblSet													*
* Function    :	コンストラクタ													*
* Argument(s) :	none															*
********************************************************************************/
CRTitleLblSet::CRTitleLblSet(void)
{
	//-----------------------------------------------------------------------
	// 初期化処理
	// シーケンス設定（関数ポインタ配列作成）
	m_lpSeq[E_SEQ_INIT ] = &CRTitleLblSet::SeqInit;	// 初期状態
	m_lpSeq[E_SEQ_IDLE ] = &CRTitleLblSet::SeqIdle;	// 待機状態
	// 子プロセス
	if(SetChildNum(E_RT_NUM) == FALSE)
	{
		Assert(FALSE);
		return;
	}

	//-----------------------------------------------------------------------
	// 初期値設定
	m_nSeq = E_SEQ_INIT;	// 初期シーケンス=初期状態

	// 初期化正常終了
	this->CRoutine::InitOK();

	Debuglog((LPWSTR)(L"CRTitleLblSet"));

	return;
}

/********************************************************************************
* FunctionName:	~CRTitleLblSet													*
* Function    :	デストラクタ													*
* Argument(s) :	none															*
********************************************************************************/
CRTitleLblSet::~CRTitleLblSet(void)
{
	Debuglog((LPWSTR)(L"~CRTitleLblSet"));
}

/********************************************************************************
*	Private Methods																*
********************************************************************************/

/********************************************************************************
* FunctionName:	CreateGuiChild													*
* Function    :	GUI系の子プロセスの生成											*
* Argument(s) :	none															*
* Return      :	FALSE=生成失敗													*
********************************************************************************/
bool
CRTitleLblSet::CreateGuiChild(void)
{
	long nID;	// ラベルID

	//-----------------------------------------------------------------------
	// ラベル種類毎にラベルオブジェクトの生成
	for(nID = 0; nID < E_TITLE_LBL_TYPE_NUM; nID++)
	{
		NEW(m_lplpRtChild[nID], CRTitleLbl(nID));
		if(m_lplpRtChild[nID] == nullptr)
		{
			return FALSE;
		}
	}

	return TRUE;
}

/********************************************************************************
* FunctionName:	IsChildAlive													*
* Function    :	子プロセスの生存判定											*
* Argument(s) :	none															*
* Return      :	TRUE=すべて生存													*
********************************************************************************/
bool
CRTitleLblSet::IsChildAlive(void)
{
	long nID;	// ラベルID

	//-----------------------------------------------------------------------
	// ラベルオブジェクト
	for(nID = 0; nID < E_TITLE_LBL_TYPE_NUM; nID++)
	{
		if(m_lplpRtChild[nID] == nullptr)
		{
			return FALSE;
		}
	}

	return TRUE;
}

/********************************************************************************
*	Private Methods (Sequence)													*
********************************************************************************/

/********************************************************************************
* FunctionName:	SeqInit															*
* Function    :	シーケンス処理:初期状態											*
* Argument(s) :	none															*
* Return      :	FALSE=処理終了（オブジェクト破棄）								*
********************************************************************************/
bool
CRTitleLblSet::SeqInit(void)
{
	//-----------------------------------------------------------------------
	// GUI系の子プロセスの生成
	if(CreateGuiChild() == FALSE)
	{
		Assert(FALSE);
		return FALSE;
	}

	// シーケンス -> 待機状態
	m_nSeq = E_SEQ_IDLE;

	return TRUE;
}

/********************************************************************************
* FunctionName:	SeqIdle															*
* Function    :	シーケンス処理:待機状態											*
* Argument(s) :	none															*
* Return      :	FALSE=処理終了（オブジェクト破棄）								*
********************************************************************************/
bool
CRTitleLblSet::SeqIdle(void)
{
	//-----------------------------------------------------------------------
	// 枝葉ルーチン生存していない -> 強制終了
	if(IsChildAlive() == FALSE)
	{
		Assert(FALSE);
		return FALSE;
	}

	return TRUE;
}

/********************************************************************************
*	Public Methods																*
********************************************************************************/

/********************************************************************************
* FunctionName:	Update															*
* Function    :	定期更新処理													*
* Argument(s) :	none															*
* Return      :	FALSE=処理終了（オブジェクト破棄）								*
* Attention(s):	呼び出し周期＝1/60sec											*
********************************************************************************/
bool
CRTitleLblSet::Update(void)
{
	//-----------------------------------------------------------------------
	// 基底クラスの処理
	if(this->CRoutine::Update() == FALSE)
	{
		return FALSE;
	}

	//-----------------------------------------------------------------------
	// シーケンス処理
	if((this->*m_lpSeq[m_nSeq])() == FALSE)
	{
		return FALSE;
	}

	return TRUE;
}

